app/controllers/school_classes_controller.rb

INSERT INTO "school_classes" ("title", "room_number") VALUES (?, ?)  [["title", "History"], ["room_number", 101]]
---
    def create
        @school = SchoolClass.new(school_params(:title, :room_number))
        @school.save

SELECT  "school_classes".* FROM "school_classes" WHERE "school_classes"."id" = ? LIMIT ?  [["id", 0], ["LIMIT", 1]]
---
    def show
        @school = SchoolClass.find(params[:id])

SELECT  "school_classes".* FROM "school_classes" WHERE "school_classes"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
    def edit
        @school = SchoolClass.find(params[:id])

SELECT  "school_classes".* FROM "school_classes" WHERE "school_classes"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "school_classes" SET "title" = ? WHERE "school_classes"."id" = ?  [["title", "World History"], ["id", 1]]
---
    def update
        @school = SchoolClass.find(params[:id])
        @school.update(school_params(:title, :room_number))