app/controllers/students_controller.rb

SELECT  "students".* FROM "students" WHERE "students"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
UPDATE "students" SET "last_name" = ?, "updated_at" = ? WHERE "students"."id" = ?  [["last_name", "Hammer The First"], ["updated_at", "2020-08-19 22:51:07.651176"], ["id", 3]]
---
    def update
        @student = Student.find(params[:id])
        @student.update(student_params(:first_name, :last_name))